# В первой строке задается строка string
# Во второй строке задается строка substring
#
# Выведите True, если строка string начинается с подстроки substring, и False в противном случае
#
# Подсказка: для этого есть готовый метод
#
# Sample Input:
#
# Begin - end
# Begin
#
# Sample Output:
#
# True

s1 = input()
s2 = input()

print(s1.startswith(s2))

