# В этой задаче вам нужно написать программу, которая считывает два вещественных
# числа и выведет их сумму (подвохов в ней нет). Числа задаются по одному в
# строке.
#
# Напомним, что для преобразования строки в вещественное число используется
# функция float
#
# Sample Input:
#
# 0.1
# 0.2
#
# Sample Output:
#
# 0.30000000000000004

a = float(input())
b = float(input())

print(a + b)
