# Дано положительное вещественное число X. Выведите его дробную часть.
#
# Sample Input:
#
# 17.9
#
# Sample Output:
#
# 0.9

x = float(input())

print(x - int(x))
