# Выведите слово One (обязательно с большой буквы!), если было введено число 1
# и не выводите ничего если было введено любое другое число.
#
# Sample Input:
#
# 2
#
# Sample Output:

if int(input()) == 1:
    print('One')
