# Выведите слово One (обязательно с большой буквы!), если было введено число 1,
# выводите фразу Not one (также обязательно с большой буквы) если было введено
# любое другое число.
#
# Sample Input:
#
# -1
#
# Sample Output:
#
# Not one

if int(input()) == 1:
    print('One')
else:
    print('Not one')
