# Вася делает ремонт в комнате размером A на B. Он хочет положить новый пол.
# Сколько квадратных метров плитки нужно ему купить?
#
# Числа A и B целые, каждое число задаётся в отдельной строке.
#
# Это первая задача на программирование, где вам требуется читать данные. Для
# чтения в переменную с названием x необходимо написать следующий код:
#
# x = int(input())
#
# В качестве ответа необходимо сдавать текст программы, решающей задачу. Ваше
# решение должно работать для любых чисел, не только для тех, которые приведены
# в примере.
#
# Sample Input:
#
# 3
# 4
#
# Sample Output:
#
# 12

A = int(input())
B = int(input())
print(A*B)
