# Лектор онлайн-курса по программированию прочитал статью британских учёных, в
# которой написано, что слова-паразиты и дефекты дикции улучшают восприятие
# материала аудиторией.
#
# У лектора есть конспект лекции, помогите ему модифицировать текст конспекта,
# вставив ", ммм, " (без кавычек) между всеми подряд идущими словами. Для вашего
# удобства текст конспекта представляется в виде, где все слова окружены
# кавычками и разделены запятыми, его можно скопировать и вставить в код
# программы.
#
# 'Питон', 'позволяет', 'автоматизировать', 'рутинные', 'задачи', 'на',
# 'решение', 'которых', 'вручную', 'уходят', 'лучшие', 'годы', 'жизни'
#
# В качестве ответа необходимо сдать только получившийся текст, не программу.
#
# Подсказка: подумайте про именованный параметр sep функции print.

print('Питон', 'позволяет', 'автоматизировать', 'рутинные', 'задачи',
      'на', 'решение', 'которых', 'вручную', 'уходят',
      'лучшие', 'годы', 'жизни', sep=", ммм, ")
