# В этой задаче вам предстоит изучить, как устроен XML для описания объектов
# OpenStreetMap. Вручную откройте скаченный файл с помощью текстового редактора
# и найдите в нём широту (атрибут lat) для тега node с id равным 6428535115
# (удобно поискать это число поиском в текстовом редакторе).
#
# Файл для скачивания: https://stepik.org/media/attachments/lesson/266068/map2.osm
#
# В качестве ответа необходимо ввести содержимое параметра lat без кавычек
# (вещественное число с 7 знаками после точки).
